In [ ]:
#ch2 Pandas

In [ ]:
# pandas is an open source library built on top of numpy
# it allows for fast analysis and data cleaning and preparation
# it excels in performance and productivity
# it also has built-in visualization features
# it can work with data from a wide variety of sources

# pip install pandas

In [ ]:
# Series
# DataFrames
# Missing Data
# GroupBy
# Merging,Joining,and Concatinating
# Operations
# Data Input and Output

In [4]:
# Series is simular to a numpy array
# Series can have axis labels - it can be indexed by a label

import numpy as np
import pandas as pd

#4 seperate python objects

#list of letters
labels = ['a','b','c']

#list of ints
my_data = [10,20,30]

#numpy array
arr = np.array(my_data)

#dictionary
d={'a':10,'b':20,'c':30}

#how to create series
pd.Series(data = my_data,index=labels)

a    10
b    20
c    30
dtype: int64

In [5]:
pd.Series(my_data,labels)

a    10
b    20
c    30
dtype: int64

In [7]:
pd.Series(arr,labels)
# numpy array will work the same as a normal list in python

a    10
b    20
c    30
dtype: int32

In [8]:
pd.Series(d)
#will automatically set the keys as the index and then the key pair value as the datapoint

a    10
b    20
c    30
dtype: int64

In [10]:
pd.Series(data=[sum,print,len])
#can pass in references to built in function as the datapoint

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [12]:
series1 = pd.Series([1,2,3,4],['USA','Germany','Russia','Japan'])
series1

USA        1
Germany    2
Russia     3
Japan      4
dtype: int64

In [13]:
series2 = pd.Series([1,2,3,4],['USA','Germany','Italy','Japan'])
series2

USA        1
Germany    2
Italy      3
Japan      4
dtype: int64

In [14]:
series1['Russia']

3

In [16]:
series2[2]

3

In [17]:
series1 + series2

Germany    4.0
Italy      NaN
Japan      8.0
Russia     NaN
USA        2.0
dtype: float64

In [ ]:
#where it cannot find a match, it places a NaN

In [24]:
# DataFrames

import numpy as np
import pandas as pd

from numpy.random import randn
np.random.seed(101)

df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [ ]:
#DataFrames a bunch of Series that share an index

In [25]:
df['W'] # W column is a series

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [26]:
type(df['W'])

pandas.core.series.Series

In [27]:
type(df)

pandas.core.frame.DataFrame

In [29]:
df.W
# be careful that if you are using this way that it does not match the name of an actual method,
# methods could get overwriten by a column name

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [30]:
#better way is to use brackets
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [31]:
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [32]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [34]:
#creating a new column
df['new'] = df['W'] + df['Y']
df
#(new has all the values added up from row W adding to Y)

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [36]:
#for removing columns you can use .drop
df.drop('new',axis=1)
#drop doesn't happen in place

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [37]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [38]:
df.drop('new',axis=1,inplace=True)
#pandas does this so that you do not accidentally lose data
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [39]:
#drop can also get rid of rows

df.drop('E')
#again not doing this in place

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [40]:
df.shape

(5, 4)

In [41]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [ ]:
# (rows,columns)
# rows are refered to as the 0 axis
# columns are refered to as the 1 axis

In [45]:
#selecting Columns
df[['Z','X']]

          Z         X
A  0.503826  0.628133
B  0.605965 -0.319318
C -0.589001  0.740122
D  0.955057 -0.758872
E  0.683509  1.978757

In [46]:
#selecting Rows .LOC
#   location[label row]
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [ ]:
# not only are the columns series but the rows are series as well as far as the way they're going to get 
# returned when you request them in Pandas

In [49]:
#the second way to grab a row is based off of index location .ILOC
df.iloc[2]

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [50]:
# can specify which row and column to index
        #row B column Y
df.loc['B','Y']

-0.8480769834036315

In [51]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [52]:
#what if you wanted the a b rows with they w y columns
df.loc[['A','B'] , ['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

In [53]:
#conditional selection using bracket notation
df > 0
# returns true if that value is greater than zero

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [54]:
booldf = df > 0
booldf

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [55]:
df[booldf]
#values to where value was true, NaN to where they were false

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [56]:
#normally you wouldn't seperate these steps and assign a var you'd just make it one line
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [57]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [58]:
df['W']>0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [60]:
df[df['W']>0]
#will only recieve the rows to where the value is > 0
#it skipped over the C row because it was a negative value

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [61]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [63]:
#grab all the rows in dataframe where z is less than 0
df[df['Z']<0]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [64]:
resultdf = df[df['W']>0]
resultdf

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [65]:
resultdf['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [66]:
#this can all be done in one step
df[df['W']>0]['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [ ]:
# indexing the datafield --> indexing column W --> return value if it is > 0 --> index the next column over and return all of those values
df[df['W']>0]['X']

In [71]:
boolseries = df['W']>0
result = df[boolseries]
mycols = ['Y','X']
result[mycols]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

In [74]:
df[df['W']>0][['Y','X']]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

In [77]:
#multiple conditions - 2 or more conditions

df[(df['W']>0) and (df['Y']>1)]
#The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all()
# pythons normal and operator can't actually take into account a series of boolean values compared to another series of boolean
# can only take in single booleans at a time

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [78]:
True and False

False

In [79]:
True and True

True

In [80]:
boolseries = df['W']>0
boolseries

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [81]:
# and operator gets confused at all the different boolean values, can only deal with single instances of values
#when you're working with pandas and want multiple conditions you have to use the & sign

df[(df['W']>0) & (df['Y']>1)]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [82]:
#if you want to do an OR operation use pipe |
df[(df['W']>0) | (df['Y']>1)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [83]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [84]:
#how to rest index back to default (range index 0,1,2,3,4--)
df.reset_index()

# original index is set to a column 
# this does not occur in place - needs inplace = True if you wanted that or variable assignment

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [86]:
newind = 'CA NY WY OR CO'.split()
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [87]:
df['States']=newind
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [91]:
#if you have a column in your dataset that you want to be the index use
df.set_index('States')

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

In [113]:
# multi index
# index hierarchy 

import numpy as np
import pandas as pd

outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [108]:
outside

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [114]:
inside

[1, 2, 3, 1, 2, 3]

In [115]:
list(zip(outside,inside))
#multi index can take this in and return ->

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [116]:
hier_index
# ->

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [118]:
ndf = pd.DataFrame(randn(6,2),hier_index,['A','B'])
ndf
# has 2 levels of an index
# this is an index hierarchy

             A         B
G1 1 -0.497104 -0.754070
   2 -0.943406  0.484752
   3 -0.116773  1.901755
G2 1  0.238127  1.996652
   2 -0.993263  0.196800
   3 -1.136645  0.000366

In [130]:
#how to call data from a multilevel index

ndf.loc['G1'].loc[1]
#start from the outside and keep calling in towards 1 row of G1 , A & B

A   -0.497104
B   -0.754070
Name: 1, dtype: float64

In [132]:
ndf.index.names#pandas is saying that these rows 1-3 dont have names

FrozenList([None, None])

In [133]:
ndf

             A         B
G1 1 -0.497104 -0.754070
   2 -0.943406  0.484752
   3 -0.116773  1.901755
G2 1  0.238127  1.996652
   2 -0.993263  0.196800
   3 -1.136645  0.000366

In [135]:
ndf.index.names = ['Groups','Nums']
ndf

                    A         B
Groups Nums
G1     1    -0.497104 -0.754070
       2    -0.943406  0.484752
       3    -0.116773  1.901755
G2     1     0.238127  1.996652
       2    -0.993263  0.196800
       3    -1.136645  0.000366

In [139]:
ndf.loc['G2'].loc[2]

A   -0.993263
B    0.196800
Name: 2, dtype: float64

In [140]:
ndf.loc['G2'].loc[2]['B']
#grabbing 1 specific value

0.19679950499134005

In [142]:
# cross section function 
# used for multi leveled index
# has the ability to go inside a multi level index
ndf.xs('G1')

             A         B
Nums
1    -0.497104 -0.754070
2    -0.943406  0.484752
3    -0.116773  1.901755

In [144]:
#if I want row 1 from G1 and G2
ndf.xs(1,level='Nums')

               A         B
Groups
G1     -0.497104 -0.754070
G2      0.238127  1.996652

In [145]:
#missing data
#using methods to change NaN values

import numpy as np
import pandas as pd

dict = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}
dataframe = pd.DataFrame(dict)
dataframe

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [146]:
# dropna method
#this would drop all rows that have a nan value in them, this will not just get rid of the nan and keep the row
dataframe.dropna()

     A    B  C
0  1.0  5.0  1

In [149]:
dataframe.dropna(axis=1)
#this will drop any columns that have a nan value

   C
0  1
1  2
2  3

In [150]:
dataframe

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [151]:
dataframe.dropna(thresh=2)
#this will keep row 1 because row 1 only had 1 nan value, not 2

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [152]:
# fillna will replace the nan value
dataframe.fillna(value='FILL VALUE')

            A           B  C
0         1.0         5.0  1
1         2.0  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [154]:
dataframe['A'].fillna(value=dataframe['A'].mean())
# that value has been filled with the mean of the values

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [1]:
# Groupby Method

# Groupby allows you to group together rows based off od a column and
# perform an aggregate function on them

import numpy as np
import pandas as pd

data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
        'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
        'Sales':[200,120,340,124,243,350]}

dfnew = pd.DataFrame(data)
dfnew

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [4]:
comp = dfnew.groupby('Company')
comp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [5]:
comp.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [6]:
comp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [7]:
comp.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [8]:
# probably won't assign comp as a var, can write this in one
# line

dfnew.groupby('Company').sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [10]:
dfnew

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [9]:
dfnew.groupby('Company').count()
#counts the number of instances per column

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [12]:
dfnew.groupby('Company').max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [14]:
dfnew.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [3]:
#merging, joining and concatinating dataframes
import pandas as pd

df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7]) 

df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [4]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [5]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [ ]:
# concatination basically glues together dataframes. keep in mind that dimensions should match along the 
# axis you are concatenating on. you can use pd.concat and pass in a list of dataframes to concatenate 
# togther

In [6]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [7]:
pd.concat([df1,df2,df3],axis = 1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [20]:
left = pd.DataFrame({'key': ['k0','k1','k2','k3'],
                    'A': ['a0','a1','a2','a3'],
                    'B': ['b0','b1','b2','b3']})

right = pd.DataFrame({'key': ['k0','k1','k2','k3'],
                    'A': ['c0','c1','c2','c3'],
                    'B': ['d0','d1','d2','d3']})

In [12]:
left

  key   A   B
0  k0  a0  b0
1  k1  a1  b1
2  k2  a2  b2
3  k3  a3  b3

In [14]:
right

  key   A   B
0  k0  c0  d0
1  k1  c1  d1
2  k2  c2  d2
3  k3  c3  d3

In [18]:
#the merge function allows you to merge DataFrames together using similar logic as merging SQL Tables together
pd.merge(left,right,how='inner',on='key')

  key A_x B_x A_y B_y
0  k0  a0  b0  c0  d0
1  k1  a1  b1  c1  d1
2  k2  a2  b2  c2  d2
3  k3  a3  b3  c3  d3

In [22]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [24]:
pd.merge(left, right, on=['key1', 'key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2